Revit 2024 API
BuiltInFailures.StairRampFailures.StairsTopLowerThanBaseFailure Property
 The top of the Stair is lower than the base of the Stair
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsTopLowerThanBaseFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsTopLowerThanBaseFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsTopLowerThanBaseFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace